Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: ཆོས་ཐམས་ཅད་ཡང་དག་པར་གཟུང་བའི་རིག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the knowledge that correctly grasps all phenomena.

source: ཆོས་ཐམས་ཅད་རབ་ཏུ་ཤེས་པར་བྱེད་པའི་རིག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the knowledge that deeply understands all phenomena.

source: འདི་དག་ནི་རིག་པ་ལ་དམིགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections focused on knowledge.

source: དེ་ལ་རྣམ་པར་གྲོལ་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of accomplishing liberation?

source: རྣམ་པར་གྲོལ་བ་ལ་མྱུར་དུ་ཞུགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as swiftly entering liberation.

source: བག་ཆགས་དང་བྲལ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as freedom from karmic imprints.

source: མཐར་འཛིན་པ་ཡོངས་སུ་སྤངས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the abandonment of extreme beliefs.

source: ཐམས་ཅད་དུ་དེའི་ངོ་བོ་མ་ཡིན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as not partaking of the nature of such beliefs in any way.

source: དུས་ཐམས་ཅད་དུ་བདེ་བ་དང་སྡུག་བསྔལ་གྱིས་མི་འཕྲོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as never being affected by pleasure and pain.

source: དེ་ཁོ་ནའི་ཆོས་ཀྱི་རྒྱུ་འཐུན་པའི་ཐམས་ཅད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight is the entirety of concordant causes for the phenomena of reality.

source: འདི་དག་ནི་རྣམ་པར་གྲོལ་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of accomplishing liberation.

source: དེ་ལ་དགེ་སློང་གི་འཁོར་ཉེ་བར་འོང་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that gather the assembly of a monk?

source: བསམ་པ་ཇི་ལྟ་བ་བཞིན་ཐམས་ཅད་དུ་སྤྲུལ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as emanations that are always just as wished.

source: ཅི་འདོད་པར་སྤྲུལ་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as emanations of whatever is desired.

source: དེ་བསམ་པ་བཞིན་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as expressions that are just as wished for.

source: ཁྱད་པར་དུ་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as special statements.

source: སེམས་ལ་འཛིན་པ་མེད་པར་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as expressions of absence of mental grasping.

source: དེ་ལས་ངེས་པར་གྲོལ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as liberation from those expressions.

source: འདི་དག་ནི་དགེ་སློང་གི་འཁོར་ཉེ་བར་འོང་བ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that gather the assembly of a monk.

source: དེ་བཞིན་དུ་བཤད་པ་འདིས་ནི་འཁོར་བརྒྱད་པོ་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་ཤེས་པར་བྱའོ། །
en: Understand that this applies equally to all the eightfold retinue.

source: དེ་ལ་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for gaining correct knowledge of meanings?

source: དོན་བརྗོད་པ་དང་དོན་མ་ཡིན་པ་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as stating what is meaningful and what is not.

source: སྐྱེ་བོ་མང་པོ་ཚིམ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as satisfying many beings.

source: དོན་ལ་སྐྱོན་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as flawless meaning.

source: འོག་མིན་གྱི་གནས་ནས་བཟུང་སྟེ། ཕན་ཚུན་བདེན་པ་རྒྱ་ཆེར་སྨྲ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence consists in extensive proclamations of the interdependent realities—starting with the Unexcelled Heaven.

source: མཚུངས་པ་རྣམས་དོན་ལ་ཆོག་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration consists in contentment with the welfare of virtuous beings.

source: མཚུངས་པ་མ་ཡིན་པའི་མི་འཁྲུགས་པའི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the reality that is unperturbed in relation to unvirtuous beings.

source: འདི་དག་ནི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections for gaining correct knowledge of meanings.

source: དེ་ལ་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for gaining correct knowledge of the Dharma?

source: ཆོས་མངོན་པར་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as speaking the Dharma.

source: གཞན་ལ་གོ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as making others understand.

source: ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as correct dedication.

source: རྒྱུན་མ་ཆད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as unbroken continuity.

source: ཆོས་གནས་པ་དང་དེ་བཞིན་ཉིད་གཞན་དུ་མི་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the continuance of the Dharma and the immutable intrinsic nature.

source: རྟག་ཏུ་ཟིལ་གྱིས་མི་ནོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as constant indomitability.

source: འདི་དག་ནི་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections for gaining correct knowledge of the Dharma.

source: དེ་ལ་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for gaining correct knowledge of language?

source: གཏམ་གྱི་ཕྱིར་ངེས་པའི་ཚིག་གི་ངོ་བོ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the nature of language for the sake of communication.

source: ཉེ་བར་ཞི་བ་ལ་ངེས་པའི་ཚིག་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as language pertaining to quelling.

source: འཇིག་རྟེན་པའི་ངག་ཐམས་ཅད་ལ་ངེས་པའི་ཚིག་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as language pertaining to all mundane speech.

source: དེ་དག་ཐམས་ཅད་ལ་གོ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence is what engenders understanding in everyone.

source: དམ་བཅས་པ་སྒྲོལ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as liberation in accordance with one’s commitment.

source: ཐར་པ་དང་འགོག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as liberation and cessation.

source: འདི་དག་ནི་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections for gaining correct knowledge of language.

source: དེ་ལ་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for gaining correct knowledge of eloquence?

source: སྤོབས་པ་སྣ་ཚོགས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as diverse forms of eloquence.

source: སྤོབས་པ་མཉེན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as gentle eloquence.

source: དེ་དག་ཐམས་ཅད་ཚིམ་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as being universally satisfying.

source: མ་གཏུགས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as being inexhaustible.

source: ཐེ་ཙོམ་གཅོད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as elimination of doubts.

source: མྱ་ངན་ལས་འདས་པ་ལ་གཞོལ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as being inclined toward nirvāṇa.

source: འདི་དག་ནི་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་བསྒྲུབ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections for gaining correct knowledge of eloquence.

source: དེ་ལ་ཡོངས་སུ་སྐྱོ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of freedom from weariness?

source: ཆོས་སྟོན་པ་ན་ཆོས་ཉན་པ་རྣམས་ལ་ཆོས་བསྟན་པས་མི་སྐྱོ་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as never tiring of teaching the Dharma to those who listen.

source: སེམས་ཅན་ལ་ཕན་པར་བསྒྲུབ་པས་མི་སྐྱོ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as never tiring in accomplishing what is of benefit to others.

source: སྐུ་རང་གིས་བཤིག་སྟེ་རྒྱ་ཆེར་བྱིན་གྱིས་བརླབས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience consists in vast blessings by sacrificing one’s own body.

source: གདུལ་བ་རྣམས་ཀྱི་ཆེད་དུ་དུས་ཐམས་ཅད་དུ་ཉེ་བར་འོང་བའི་རྫུ་འཕྲུལ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence consists in constant displays of appropriate miraculous feats for the sake of those to be trained.

source: ཇི་ལྟར་འདོད་པ་བཞིན་སྙོམས་པར་འཇུག་པ་ལ་སྙོམས་པར་ཞུགས་པ་ན་གདམས་ངག་སྟེར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as granting practical instructions based on entering meditative attainment as one wishes.

source: དུས་དང་དུས་མ་ཡིན་པར་ཆོས་ཉན་པ་རྣམས་ལ་ཇི་སྙེད་འདོད་པ་དེ་སྙེད་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟེ།
en: Insight ripens as teaching the Dharma in accordance with the wishes of the those who listen, regardless of the time.

source: འདི་དག་ནི་ཡོངས་སུ་སྐྱོ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of freedom from weariness.

source: དེ་ལ་སྦྱིན་པ་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of deliverance through generosity?

source: སློང་བ་ལ་བྱིན་ནས་བདེ་བར་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as dedication to happiness when giving gifts to beggars.

source: ལུས་དང་ངག་གི་ལྷག་པར་སྦྱིན་པ་བྱིན་པས་དང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as righteousness through physical and verbal generosity.

source: སྦྱིན་པ་ལ་དགའ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as delighting in generosity.

source: སྦྱིན་པ་བྱིན་པ་ན་ཕ་རོལ་གནོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as overwhelming others with generosity.

source: སེམས་དང་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as clarity of mind.

source: སྦྱིན་པ་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as generosity dedicated to awakening.

source: འདི་དག་ནི་སྦྱིན་པ་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of deliverance through generosity.

source: དེ་ལ་ཚུལ་ཁྲིམས་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of deliverance through discipline?

source: བསླབ་པ་ཡང་དག་པར་བླང་བ་བྱིན་པ་དང་། སེམས་ཅན་རྣམས་ལ་མི་འཇིགས་པ་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as giving the vows of training and the gifts of fearlessness to sentient beings.

source: མི་འཇིགས་པ་བྱིན་པ་ལ་འཁྲུག་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as being unshakable when giving fearlessness.

source: སེམས་ཅན་རྣམས་ལ་ཕན་པར་སེམས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as wanting to benefit sentient beings.

source: བསླབ་པ་ཀུན་ནས་སྲུང་ཞིང་ཕ་རོལ་གནོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as maintaining all aspects of the training and overpowering others.

source: བསླབ་པ་སྔོན་དུ་བཏང་ནས་སེམས་ཅན་རྣམས་ལ་ཕན་པར་སེམས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as wanting to benefit sentient beings via the points of training.

source: བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as dedication to awakening.

source: འདི་དག་ནི་ཚུལ་ཁྲིམས་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of deliverance through discipline.

source: དེ་ལ་བཟོད་པ་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of deliverance through patience?

source: སེམས་ཅན་བདེ་ན་དང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as being inspired by the happiness of sentient beings.

source: སེམས་ཅན་གྱི་ཉོན་མོངས་པ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as tolerating the defilements of sentient beings.

source: འཁོར་བ་ཐོག་མ་མེད་པ་ནས་སྐྱེ་བ་ལ་མི་མཇེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as not forgetting where one was born throughout saṃsāra without beginning.

source: རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ངེས་པར་རྩོམ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as perpetual and uninterrupted determination.

source: སེམས་ཅན་ལ་ཕན་པར་ངེས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as being certain to benefit sentient beings.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as dedication to omniscience.

source: འདི་དག་ནི་བཟོད་པ་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of deliverance through patience.

source: དེ་ལ་བརྩོན་འགྲུས་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of deliverance through diligence?

source: འཇིག་རྟེན་ལ་ཕན་པར་སྦྱོར་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as beneficial engagements with the world.

source: གནོད་པ་མེད་པར་ཕ་རོལ་གནོན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as subduing others without harming them.

source: སྡུག་བསྔལ་ཐོབ་པ་ཐར་བར་བྱས་པ་ནི་དཔེར་ན་ཐི་བའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as liberating those in pain, as exemplified by the pigeon.

source: སྦྱོར་བ་མ་བཏང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as not abandoning one’s engagements.

source: བརྩོན་འགྲུས་ཀྱིས་སྒྲིབ་པ་སེལ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as diligently purifying obscurations.

source: སངས་རྒྱས་ཀྱི་ཡུལ་དུ་ཡོངས་སུ་བསྔོ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as dedication toward the realm of the buddhas.

source: འདི་དག་ནི་བརྩོན་འགྲུས་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of deliverance through diligence.

source: དེ་ལ་བསམ་གཏན་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of deliverance through concentration?

source: བྱམས་པ་གཙོ་བོའི་བསམ་གཏན་སེམས་ཅན་ལ་ཕན་པ་དང་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as concentration inspired by love that benefits sentient beings.

source: སེམས་ཅན་ལ་ཕན་པའི་འདུ་ཤེས་ཅན་གྱི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as concentrating on benefiting sentient beings.

source: འཇིག་རྟེན་ལ་ཕན་པར་སེམས་སྤྲོ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as delighting in benefiting the world.

source: ཉེ་བར་ཞི་བའི་ཕྱིར་ངེས་པར་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as deliverance due to pacification.

source: ཆོས་ཀྱི་སྦྱིན་པ་ལེགས་པར་བསམས་ནས་སྨྲ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as speech based on the intent to give the gift of the Dharma.

source: རང་བཞིན་གྱིས་གནས་པའི་ངེས་པའི་ཚིག་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as innately present etymological finesse.

source: འདི་དག་ནི་བསམ་གཏན་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of deliverance through concentration.

source: དེ་ལ་ཤེས་རབ་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of deliverance through insight?

source: ཆོས་ཀྱི་སྦྱིན་པ་རབ་ཏུ་སྦྱིན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as giving the gift of Dharma.

source: ཆོས་ཀྱི་སྦྱིན་པ་ཟང་ཟིང་མེད་པར་སྨྲ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as teaching and giving the gift of Dharma without any concern for material things.

source: ཆོས་ཀྱི་སྦྱིན་པ་ལ་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as never becoming weary of giving the gift of Dharma.

source: དད་པས་ངེས་པར་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as deliverance through faith.

source: རང་བཞིན་གྱི་དེ་བཞིན་ཉིད་དང་ངེས་པའི་ཚིག་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as knowledge of natural suchness and language.

source: འདི་དག་ནི་ཤེས་རབ་ལས་ངེས་པར་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of deliverance through insight.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་མིག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the ripening of the eye?

source: མཐོང་ན་དགའ་བར་འགྱུར་བའི་མིག་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: Generosity ripens as eyes that are delightful to behold.

source: མིག་བལྟ་ན་སྡུག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as beautiful eyes.

source: ཐག་རིང་པོར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as eyes that see at great distance.

source: མིག་དཀྱུས་རིང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as elongated eyes.

source: བལྟས་པས་དང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as clarity when looking.

source: ཀུན་ནས་ཤིན་ཏུ་དང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as great clarity in all regards.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་མིག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the ripening of the eye.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་རྣ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the ripening of the ear?

source: རྣ་བ་ཉམས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as ears free of impairment.

source: རྣ་བ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as pure ears.

source: རྣ་བའི་ཁམས་ཤིན་ཏུ་དང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as great clarity with respect to the ear element.

source: རྣ་བ་ཆ་ཕྲ་བ་ཐོས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the capacity to hear subtle sounds.

source: རྣ་བ་ཐག་རིང་བ་ཐོས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as ears that hear at great distance.

source: བཀུར་སྟི་མ་ཡིན་པ་ཐོས་ན་མི་དགའ་བ་མེད་པའི་རྣ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as not becoming displeased when hearing disrespectful words.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་རྣ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the ripening of the ear.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་སྣའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the ripening of the nose?

source: དང་བར་འགྱུར་བའི་སྣ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as clarity with respect to the nose.

source: སྣའི་དབང་པོ་མ་ཉམས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as an unimpaired olfactory faculty.

source: ཡིད་དུ་འོང་བ་སྣོམ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as smelling delightful fragrances.

source: མི་འཐུན་པ་སྣོམ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as sensing diverse smells.

source: སྣ་མ་གཏུགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as an incorruptible nose faculty.

source: སྐྱོན་སྣོམ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the sniffing out of flaws.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་སྣའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the ripening of the nose.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་ལྕེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the ripening of the tongue?

source: ལྕེས་རོ་མྱངས་ན་དང་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as clarity regarding the tongue’s perception of tastes.

source: ཁེངས་ཚིག་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as the absence of arrogant words.

source: སྐྱེ་བོ་མང་པོ་འདོད་པའི་ཚིག་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the utterance of words desired by many people.

source: ཡི་གེ་མང་པོ་རྗེས་སུ་དྲན་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as remembering many letters.

source: ལྕེ་རྐན་ལ་གཞར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as a tongue that fits with the palate.

source: ལྕེ་མཆོག་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the supreme tongue.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་ལྕེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the ripening of the tongue.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་ལུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the ripening of the body?

source: ལུས་ཤས་རྒྱས་ཤིང་མདོག་དམར་སེར་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as fully developed flesh with red and golden hues.

source: སྐྱེ་བོ་མང་པོས་བལྟ་ན་སྡུག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as being delightful to see by many.

source: ལུས་དབང་ཆེ་བར་གྲགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as a renowned physical presence.

source: ལུས་བརྟན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as firmness of the body.

source: ལུས་ཤིན་ཏུ་གཞོན་ཤ་ཆགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as tremendous physical youthfulness.

source: གཙོ་བོར་འགྲོ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the gait of a leader.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་ལུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the ripening of the body.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་སེམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the ripening of the mind?

source: སེམས་འདོད་ཆགས་ཆུང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as having few mental desires.

source: ཞེ་སྡང་ཆུང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as having little anger.

source: གཏི་མུག་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as an absence of dullness.

source: རྟོགས་པ་རྣོ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as sharp understanding.

source: སྤོང་བ་དང་རྗེས་སུ་འཐུན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as being in accord with abandonment.

source: ཇི་ལྟར་འདོད་པ་བཞིན་ཆོས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པ་མང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as abundant comprehension of all phenomena in accordance with one’s wishes.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་སེམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the ripening of the mind.

source: དེ་ལ་གཞན་ལ་ཕན་པར་ཡོངས་སུ་བསྔོས་པའི་ཟང་ཟིང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of material things dedicated to benefiting others?

source: གཞན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྦྱིན་པ་ནི་དཔེར་ན་རྒྱལ་པོའི་བུ་སྙིང་སྟོབས་ཞུམ་པ་མེད་ཀྱིས་འཛམ་བུའི་གླིང་པའི་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱས་ནས། ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡོངས་སུ་སྨིན་པར་བྱས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as generosity that ripens others, as exemplified by Prince Undeterrable Courage, who satisfied sentient beings on Jambudvīpa while causing them all to ripen for the sake of awakening.

source: གཞན་ལ་ཕན་པ་དང་ལྡན་པའི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པ་སྙིང་སྟོབས་ནི་དཔེར་ན་སྲེག་པས་མེས་ཚིག་པར་བྱེད་པ་བསད་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as courageous discipline for the benefit of others, as exemplified by the quail that extinguished the raging fire.

source: གཞན་ལ་ཕན་པར་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའི་རྣམ་པར་སྨིན་པ་འཁོར་བ་ནི་དཔེར་ན། ཚངས་པས་སེམས་ཅན་དྲུག་ཅུ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཉོན་མོངས་པ་བཟོད་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as patience dedicated to benefiting others in saṃsāra, as exemplified by Brahmā who accepted hardship for the sake of ripening sixty sentient beings.

source: གཞན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་བརྩོན་འགྲུས་ནི་དཔེར་ན་ནད་པ་སྲོག་གི་ལྷག་མ་ལུས་པ་ལ་ལོ་བདུན་ཅུར་ཕན་པར་བྱ་བར་འདོད་པའི་ཡིད་ཀྱིས་དཔག་ཚད་བདུན་བརྒྱར་སོང་ནས་རི་གངས་ཅན་ལས་སྨན་བླངས་ཏེནད་པ་ཐར་བར་བྱས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as diligence that ripens others, as exemplified by the one who spent seventy years traveling seven hundred leagues to the Himalayas to obtain healing medicine with the wish to benefit the mortally ill.

source: གཞན་ལ་ཕན་ཞིང་བདེ་བ་དང་ལྡན་པའི་བསམ་གཏན་ནི་དཔེར་ན་དྲང་སྲོང་སེར་སྐྱས་སེམས་ཅན་ལ་ཕན་པར་བྱ་བའི་ཕྱིར་གྲོང་ཁྱེར་བརྩིགས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as concentration that brings help and happiness to others, as exemplified by the sage Kapila, who built a city for the benefit of sentient beings.

source: གཞན་བདེ་བར་བསྒྲུབ་པའི་ཤེས་རབ་ནི་དཔེར་ན་བསྟན་བཅོས་ཐམས་ཅད་དང་། ཡིག་འབྲུ་རྣམས་གསོ་བར་བྱེད་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as insight that yields happiness for others, such as causing an abundance of all the treatises and letters.

source: འདི་དག་ནི་གཞན་ལ་ཕན་པར་ཡོངས་སུ་བསྔོས་པའི་ཟང་ཟིང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of material things dedicated to benefiting others.

source: དེ་ལ་བདག་ལ་ཕན་པར་ཡོངས་སུ་བསྔོས་པའི་ཟང་ཟིང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of material things dedicated to benefiting oneself?
